""" Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности """

lst = [1, 2, 3, 3, 4, 2, 5]
print(set(lst))
